# Creator Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksharingTooltipInfo..::..Creator Property
WorksharingTooltipInfo Class See Also
---
The user name of the user who created the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string Creator { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Creator As String
	Get
```

Visual C++
---
```text
public:
property String^ Creator {
	String^ get ();
}
```

# See Also
WorksharingTooltipInfo Class
Autodesk.Revit.DB Namespace